<a href="https://colab.research.google.com/github/kaushal-codes/Data-Science/blob/main/Assignment_8_Data_Wrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1><center>DATA WRANGLING</center></h1>

## Hierarchical Indexing

Hierarchical indexing is an important feature of pandas that enables you to have mul‚Äê
tiple (two or more) index levels on an axis.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [ ]:
data

a  1   -1.500312
   2    0.984660
   3    0.304341
b  1    0.296940
   3   -1.425450
c  1   -1.177166
   2   -0.324394
d  2    0.974205
   3    0.617651
dtype: float64

In [ ]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [ ]:
data['b']

1    0.29694
3   -1.42545
dtype: float64

In [ ]:
data['b':'c']

b  1    0.296940
   3   -1.425450
c  1   -1.177166
   2   -0.324394
dtype: float64

In [ ]:
data['c':'d']

c  1   -1.177166
   2   -0.324394
d  2    0.974205
   3    0.617651
dtype: float64

In [ ]:
data.loc[['b','d']]

b  1    0.296940
   3   -1.425450
d  2    0.974205
   3    0.617651
dtype: float64

In [ ]:
data.loc[:,2]

a    0.984660
c   -0.324394
d    0.974205
dtype: float64

In [ ]:
# Rearrange the data into a DataFrame using its unstack method:

data.unstack()

          1         2         3
a -1.500312  0.984660  0.304341
b  0.296940       NaN -1.425450
c -1.177166 -0.324394       NaN
d       NaN  0.974205  0.617651

In [ ]:
# The inverse operation of unstack is stack:

data.unstack().stack()

a  1   -1.500312
   2    0.984660
   3    0.304341
b  1    0.296940
   3   -1.425450
c  1   -1.177166
   2   -0.324394
d  2    0.974205
   3    0.617651
dtype: float64

In [ ]:
# With a DataFrame, either axis can have a hierarchical index:

frame = pd.DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
        columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [ ]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [ ]:
frame.index.names=['Key1','Key2']

In [ ]:
frame

           Ohio     Colorado
          Green Red    Green
Key1 Key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame.columns.names = ['state','color']

In [ ]:
frame

state      Ohio     Colorado
color     Green Red    Green
Key1 Key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
# With partial column indexing you can similarly select groups of columns:

frame['Ohio']

color      Green  Red
Key1 Key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [ ]:
'''A MultiIndex can be created by itself and then reused; the columns in the preceding
DataFrame with level names could be created like this:'''

from pandas import MultiIndex

MIndex = MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],names=['state', 'color'])

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
        columns = MIndex)

In [ ]:
frame

state  Ohio     Colorado
color Green Red    Green
a 1       0   1        2
  2       3   4        5
b 1       6   7        8
  2       9  10       11

## Reordering and Sorting Levels

At times you will need to rearrange the order of the levels on an axis or sort the data
by the values in one specific level. The swaplevel takes two level numbers or names
and returns a new object with the levels interchanged (but the data is otherwise
unaltered):

In [ ]:
frame.swaplevel('Key1','Key2')

           Ohio     Colorado
          Green Red    Green
Key2 Key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [ ]:
frame.sort_index(level=1)

           Ohio     Colorado
          Green Red    Green
Key1 Key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [ ]:
frame.swaplevel('Key1','Key2').sort_index(level=0)

           Ohio     Colorado
          Green Red    Green
Key2 Key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [ ]:
frame.swaplevel(1, 0).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
Key2 Key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## Summary Statistics by Level

Many descriptive and summary statistics on DataFrame and Series have a level
option in which you can specify the level you want to aggregate by on a particular
axis. Consider the above DataFrame; we can aggregate by level on either the rows or
columns like so:

In [ ]:
frame.sum(level='Key1')

      Ohio     Colorado
     Green Red    Green
Key1
a        3   5        7
b       15  17       19

In [ ]:
frame

           Ohio     Colorado
          Green Red    Green
Key1 Key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame.columns.names = ['state','color']

In [ ]:
frame

state      Ohio     Colorado
color     Green Red    Green
Key1 Key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [ ]:
frame.swaplevel('Key1','Key2')

state      Ohio     Colorado
color     Green Red    Green
Key2 Key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [ ]:
frame.sum(level="Key1",axis=0)

state  Ohio     Colorado
color Green Red    Green
Key1
a         3   5        7
b        15  17       19

In [ ]:
frame.sum(level="Key2",axis=0)

state  Ohio     Colorado
color Green Red    Green
Key2
1         6   8       10
2        12  14       16

## Indexing with a DataFrame‚Äôs columns

In [ ]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),'c': ['one', 'one', 'one', 'two', 'two','two', 'two'],
        'd': [0, 1, 2, 0, 1, 2, 3]})

In [ ]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [ ]:
frame2=frame.set_index(['c','d'])

In [ ]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default the columns are removed from the DataFrame, though you can leave them
in:

In [ ]:
frame2=frame.set_index(['c','d'],drop=False)

In [ ]:
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

reset_index, on the other hand, does the opposite of set_index; the hierarchical
index levels are moved into the columns:

In [ ]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Combining and Merging Datasets

Data contained in pandas objects can be combined together in a number of ways:
- pandas.merge connects rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements -database join operations.
- pandas.concat concatenates or ‚Äústacks‚Äù together objects along an axis.
- The combine_first instance method enables splicing together overlapping data to fill in missing values in one object with values from another.

Different join types with how argument.

- 'inner' Use only the key combinations observed in both tables
- 'left' Use all key combinations found in the left table
- 'right' Use all key combinations found in the right table
- 'output' Use all key combinations observed in both tables together

### merge function arguments

- left - DataFrame to be merged on the left side.
- right - DataFrame to be merged on the right side.
- how - One of 'inner', 'outer', 'left', or 'right'; defaults to 'inner'.
- on - Column names to join on. Must be found in both DataFrame objects. If not specified and no other join keys
given, will use the intersection of the column names in left and right as the join keys.
- left_on - Columns in left DataFrame to use as join keys.
- right_on - Analogous to left_on for left DataFrame.
- left_index - Use row index in left as its join key (or keys, if a MultiIndex).
- right_index - Analogous to left_index.
- sort - Sort merged data lexicographically by join keys; True by default (disable to get better performance in
some cases on large datasets).
- suffixes - Tuple of string values to append to column names in case of overlap; defaults to ('_x', '_y') (e.g., if
'data' in both DataFrame objects, would appear as 'data_x' and 'data_y' in result).
- copy - If False, avoid copying data into resulting data structure in some exceptional cases; by default always
copies.
- indicator - Adds a special column _merge that indicates the source of each row; values will be 'left_only',
'right_only', or 'both' based on the origin of the joined data in each row.

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})

In [ ]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [ ]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [ ]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

Note that I didn‚Äôt specify which column to join on. If that information is not speci‚Äê
fied, merge uses the overlapping column names as the keys. It‚Äôs a good practice to
specify explicitly, though:

In [ ]:
 pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

If the column names are different in each object, you can specify them separately:

In [ ]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})

In [ ]:
 df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})

In [ ]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [ ]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [ ]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [ ]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

Many-to-many merges have well-defined, though not necessarily intuitive, behavior.
Here‚Äôs an example:

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'data2': range(5)})

In [ ]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [ ]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [ ]:
pd.merge(df1,df2, on='key',how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

Many-to-many joins form the Cartesian product of the rows. Since there were three
'b' rows in the left DataFrame and two in the right one, there are six 'b' rows in the
result. The join method only affects the distinct key values appearing in the result:

In [ ]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

To merge with multiple keys, pass a list of column names

In [ ]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'],'lval': [1, 2, 3]})

In [ ]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [ ]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],'key2': ['one', 'one', 'one', 'two'],'rval': [4, 5, 6, 7]})

In [ ]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [ ]:
pd.merge(left, right, on=['key1', 'key2'], how='left')

  key1 key2  lval  rval
0  foo  one     1   4.0
1  foo  one     1   5.0
2  foo  two     2   NaN
3  bar  one     3   6.0

A last issue to consider in merge operations is the treatment of overlapping column
names. While you can address the overlap manually (see the earlier section on
renaming axis labels), merge has a suffixes option for specifying strings to append
to overlapping names in the left and right DataFrame objects:

In [ ]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [ ]:
 pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on Index

In some cases, the merge key(s) in a DataFrame will be found in its index. In this
case, you can pass left_index=True or right_index=True (or both) to indicate that
the index should be used as the merge key:

In [ ]:
import pandas as pd
import numpy as np
left1 = pd.DataFrame({'Key':['a','b','c','d','e'],'value':range(5)})

In [ ]:
left1.set_index('Key',inplace=True)

In [ ]:
left1

     value
Key
a        0
b        1
c        2
d        3
e        4

In [ ]:
right1 = pd.DataFrame({'key':['a','b'],'group_val': [3.5, 7]})

In [ ]:
right1

  key  group_val
0   a        3.5
1   b        7.0

In [ ]:
pd.merge(left1, right1,right_on='key',left_index = True,how='inner')

   value key  group_val
0      0   a        3.5
1      1   b        7.0

Since the default merge method is to intersect the join keys, you can instead form the
union of them with an outer join:

In [ ]:
 pd.merge(left1, right1, right_on='key', left_index=True, how='outer')

     value key  group_val
0.0      0   a        3.5
1.0      1   b        7.0
NaN      2   c        NaN
NaN      3   d        NaN
NaN      4   e        NaN

In [ ]:
 lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio','Nevada', 'Nevada'],'key2': [2000, 2001, 2002, 2001, 2002],
 ....: 'data': np.arange(5.)})

In [ ]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [ ]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),index=[['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'],
 ....: [2001, 2000, 2000, 2000, 2001, 2002]],
 ....: columns=['event1', 'event2'])

In [ ]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [ ]:
 pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [ ]:
 pd.merge(lefth, righth, left_on=['key1', 'key2'],right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

Using the indexes of both sides of the merge is also possible:

In [ ]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],index=['a', 'c', 'e'],columns=['Ohio', 'Nevada'])

In [ ]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],index=['b', 'c', 'd', 'e'],columns=['Missouri', 'Alabama'])

In [ ]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [ ]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [ ]:
pd.merge(left2, right2, how='inner',left_index=True,right_index=True)

#perform merge operation in both left and right table index [left_index=True,right_index=True]

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [ ]:
pd.merge(left2, right2, how='outer',left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

DataFrame has a convenient join instance for merging by index. It can also be used
to combine together many DataFrame objects having the same or similar indexes but
non-overlapping columns. In the prior example, we could have written:

In [ ]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In part for legacy reasons (i.e., much earlier versions of pandas), DataFrame‚Äôs join
method performs a left join on the join keys, exactly preserving the left frame‚Äôs row
index. It also supports joining the index of the passed DataFrame on one of the col‚Äê
umns of the calling DataFrame

In [ ]:
left1

     value
Key
a        0
b        1
c        2
d        3
e        4

In [ ]:
right1.columns=['Key','Group_val']

In [ ]:
right1

  Key  Group_val
0   a        3.5
1   b        7.0

In [ ]:
right1.join(left1,on='Key')

  Key  Group_val  value
0   a        3.5      0
1   b        7.0      1

In [ ]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],index=['a', 'c', 'e', 'f'],columns=['New York', 'Oregon'])

In [ ]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [ ]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [ ]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [ ]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [ ]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

### Concatenating Along an Axis

Another kind of data combination operation is referred to interchangeably as concat‚Äê
enation, binding, or stacking. NumPy‚Äôs concatenate function can do this with
NumPy arrays:

In [ ]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [ ]:
np.concatenate([arr, arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

### concat function arguments

The concat function in pandas provides a consistent way to address each of these
concerns. I‚Äôll give a number of examples to illustrate how it works. Suppose we have
three Series with no index overlap:

- **objs** - List or dict of pandas objects to be concatenated; this is the only required argument
- **axis** - Axis to concatenate along; defaults to 0 (along rows)
- **join** - Either 'inner' or 'outer' ('outer' by default); whether to intersection (inner) or union (outer) together indexes along the other axes
- **join_axes** - Specific indexes to use for the other n‚Äì1 axes instead of performing union/intersection logic
- **keys** - Values to associate with objects being concatenated, forming a hierarchical index along the concatenation axis; can either be a list or array of arbitrary values, an array of tuples, or a list of arrays (if multiple-level arrays passed in levels)
- **levels** - Specific indexes to use as hierarchical index level or levels if keys passed
- **names** - Names for created hierarchical levels if keys and/or levels passed
- **verify_integrity** - Check new axis in concatenated object for duplicates and raise exception if so; by default (False)
allows duplicates
- **ignore_index** - Do not preserve indexes along concatenation axis, instead producing a new range(total_length) index

In [ ]:
s1 = pd.Series([0, 1], index=['a', 'b'])

In [ ]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [ ]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [ ]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

By default concat works along axis=0, producing another Series. If you pass axis=1,
the result will instead be a DataFrame (axis=1 is the columns):

In [ ]:
pd.concat([s1, s2, s3], axis=1,join="outer")

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [ ]:
s4 = pd.concat([s1, s3])

In [ ]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [ ]:
 pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [ ]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

You can even specify the axes to be used on the other axes with join_axes:

In [ ]:
result= pd.concat([s1,s1,s2],axis=0,keys=['one','two','three'])

In [ ]:
result

one    a    0
       b    1
two    a    0
       b    1
three  c    2
       d    3
       e    4
dtype: int64

In [ ]:
result.unstack()

         a    b    c    d    e
one    0.0  1.0  NaN  NaN  NaN
two    0.0  1.0  NaN  NaN  NaN
three  NaN  NaN  2.0  3.0  4.0

In the case of combining Series along axis=1, the keys become the DataFrame col‚Äê
umn headers:

In [ ]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

The same logic extends to DataFrame objects:

In [ ]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
 ....: columns=['one', 'two'])

In [ ]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [ ]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
 ....: columns=['three', 'four'])

In [ ]:
df2

   three  four
a      5     6
c      7     8

In [ ]:
pd.concat([df1, df2], axis=0, keys=['level1', 'level2'])

          one  two  three  four
level1 a  0.0  1.0    NaN   NaN
       b  2.0  3.0    NaN   NaN
       c  4.0  5.0    NaN   NaN
level2 a  NaN  NaN    5.0   6.0
       c  NaN  NaN    7.0   8.0

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

If you pass a dict of objects instead of a list, the dict‚Äôs keys will be used for the keys
option:

In [ ]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
 .....: names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [ ]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [ ]:
df1

          a         b         c         d
0 -1.355375 -0.042080  0.413574 -1.313131
1 -0.277643  0.503902  0.441448 -0.174268
2 -0.673647 -0.336619  0.703966  0.630479

In [ ]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [ ]:
df2

          b         d         a
0  0.637043 -0.182044  1.142839
1 -0.856315 -0.373455  2.074000

In [ ]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -1.355375 -0.042080  0.413574 -1.313131
1 -0.277643  0.503902  0.441448 -0.174268
2 -0.673647 -0.336619  0.703966  0.630479
3  1.142839  0.637043       NaN -0.182044
4  2.074000 -0.856315       NaN -0.373455

### Combining Data with Overlap

There is another data combination situation that can‚Äôt be expressed as either a merge
or concatenation operation. You may have two datasets whose indexes overlap in full
or part. As a motivating example, consider NumPy‚Äôs where function, which performs
the array-oriented equivalent of an if-else expression:

In [ ]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],index=['f', 'e', 'd', 'c', 'b', 'a'])

In [ ]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [ ]:
b = pd.Series(np.arange(len(a), dtype=np.float64),index=['f', 'e', 'd', 'c', 'b', 'a'])

In [ ]:
b[-1] = np.nan

In [ ]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [ ]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [ ]:
pd.isnull(a)

f     True
e    False
d     True
c    False
b    False
a     True
dtype: bool

Series has a combine_first method, which performs the equivalent of this operation
along with pandas‚Äôs usual data alignment logic:

In [ ]:
b[0:3].combine_first(a[0:4])

c    3.5
d    2.0
e    1.0
f    0.0
dtype: float64

With DataFrames, combine_first does the same thing column by column, so you
can think of it as ‚Äúpatching‚Äù missing data in the calling object with data from the
object you pass:

In [ ]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.],'c': range(2, 18, 4)})

In [ ]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],'b': [np.nan, 3., 4., 6., 8.]})

In [ ]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [ ]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [ ]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## Reshaping and Pivoting

There are a number of basic operations for rearranging tabular data. These are alter‚Äê
natingly referred to as reshape or pivot operations.

### Reshaping with Hierarchical Indexing

Hierarchical indexing provides a consistent way to rearrange data in a DataFrame.

There are two primary actions:

**stack** - This ‚Äúrotates‚Äù or pivots from the columns in the data to the rows

**unstack** - This pivots from the rows into the columns

In [ ]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
 .....: index=pd.Index(['Ohio', 'Colorado'], name='state'),
 .....: columns=pd.Index(['one', 'two', 'three'],
 .....: name='number'))

In [ ]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
result = data.stack()

In [ ]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [ ]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

By default the innermost level is unstacked (same with stack). You can unstack a dif‚Äê
ferent level by passing a level number or name:

In [ ]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [ ]:
result.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [ ]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [ ]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [ ]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [ ]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [ ]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [ ]:
data2.unstack(0)

   one  two
a  0.0  NaN
b  1.0  NaN
c  2.0  4.0
d  3.0  5.0
e  NaN  6.0

In [ ]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [ ]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

When you unstack in a DataFrame, the level unstacked becomes the lowest level in
the result:

In [ ]:
df = pd.DataFrame({'left': result, 'right': result + 5},
 .....: columns=pd.Index(['left', 'right'], name='side'))

In [ ]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [ ]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [ ]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### Pivoting ‚ÄúLong‚Äù to ‚ÄúWide‚Äù Format

A common way to store multiple time series in databases and CSV is in so-called long
or stacked format. Let‚Äôs load some example data and do a small amount of time series
wrangling and other data cleaning:

In [ ]:
data = pd.read_csv('./Dataset/macrodata.csv')

In [ ]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [ ]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,
 .....: name='date')

In [ ]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [ ]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [ ]:
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [ ]:
data = data.reindex(columns=columns)

In [ ]:
data

item    realgdp  infl  unemp
0      2710.349  0.00    5.8
1      2778.801  2.34    5.1
2      2775.488  2.74    5.3
3      2785.204  0.27    5.6
4      2847.699  2.31    5.2
..          ...   ...    ...
198   13324.600 -3.16    6.0
199   13141.920 -8.79    6.9
200   12925.410  0.94    8.1
201   12901.504  3.37    9.2
202   12990.341  3.56    9.6

[203 rows x 3 columns]

In [ ]:
data.index = periods.to_timestamp('D', 'end')

In [ ]:
data

item                             realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
...                                  ...   ...    ...
2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 3 columns]

In [ ]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [ ]:
ldata

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

In [ ]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [ ]:
pivoted = ldata.pivot('date', 'item', 'value')

In [ ]:
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

The first two values passed are the columns to be used respectively as the row and
column index, then finally an optional value column to fill the DataFrame. Suppose
you had two value columns that you wanted to reshape simultaneously

In [ ]:
ldata['value2'] = np.random.randn(len(ldata))

In [ ]:
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.101070
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.775337
2 1959-03-31 23:59:59.999999999    unemp     5.800 -0.289894
3 1959-06-30 23:59:59.999999999  realgdp  2778.801  0.236553
4 1959-06-30 23:59:59.999999999     infl     2.340 -1.522471
5 1959-06-30 23:59:59.999999999    unemp     5.100  0.322256
6 1959-09-30 23:59:59.999999999  realgdp  2775.488  0.642608
7 1959-09-30 23:59:59.999999999     infl     2.740  1.293816
8 1959-09-30 23:59:59.999999999    unemp     5.300 -0.076443
9 1959-12-31 23:59:59.999999999  realgdp  2785.204  1.623030

In [ ]:
pivoted = ldata.pivot('date', 'item')

In [ ]:
pivoted

                              value                     value2            \
item                           infl    realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00   2710.349   5.8 -0.775337  0.101070
1959-06-30 23:59:59.999999999  2.34   2778.801   5.1 -1.522471  0.236553
1959-09-30 23:59:59.999999999  2.74   2775.488   5.3  1.293816  0.642608
1959-12-31 23:59:59.999999999  0.27   2785.204   5.6 -1.269019  1.623030
1960-03-31 23:59:59.999999999  2.31   2847.699   5.2  1.442736  1.090278
...                             ...        ...   ...       ...       ...
2008-09-30 23:59:59.999999999 -3.16  13324.600   6.0  0.974920  1.217666
2008-12-31 23:59:59.999999999 -8.79  13141.920   6.9  0.673879 -3.020404
2009-03-31 23:59:59.999999999  0.94  12925.410   8.1  1.708662  0.287558
2009-06-30 23:59:59.999999999  3.37  12901.504   9.2 -0.713630 -0.931730
2009-09-30 23:59:59.999999999  3.56  12990.341   9.6  0.506622 -1.442782


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.289894
1959-06-30 23:59:59.999999999  0.322256
1959-09-30 23:59:59.999999999 -0.076443
1959-12-31 23:59:59.999999999 -1.246025
1960-03-31 23:59:59.999999999 -1.222467
...                                 ...
2008-09-30 23:59:59.999999999  0.265989
2008-12-31 23:59:59.999999999 -3.041866
2009-03-31 23:59:59.999999999 -0.911421
2009-06-30 23:59:59.999999999 -0.321302
2009-09-30 23:59:59.999999999  0.406830

[203 rows x 6 columns]

In [ ]:
pivoted[:5]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.775337  0.101070
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -1.522471  0.236553
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.293816  0.642608
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6 -1.269019  1.623030
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  1.442736  1.090278


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.289894
1959-06-30 23:59:59.999999999  0.322256
1959-09-30 23:59:59.999999999 -0.076443
1959-12-31 23:59:59.999999999 -1.246025
1960-03-31 23:59:59.999999999 -1.222467

In [ ]:
pivoted['value'][:5]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [ ]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')

In [ ]:
unstacked[:7]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.775337  0.101070
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -1.522471  0.236553
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3  1.293816  0.642608
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6 -1.269019  1.623030
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  1.442736  1.090278
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2 -0.378595  2.462551
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6  0.932123 -0.361540


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.289894
1959-06-30 23:59:59.999999999  0.322256
1959-09-30 23:59:59.999999999 -0.076443
1959-12-31 23:59:59.999999999 -1.246025
1960-03-31 23:59:59.999999999 -1.222467
1960-06-30 23:59:59.999999999 -0.111058
1960-09-30 23:59:59.999999999  0.378706

### Pivoting ‚ÄúWide‚Äù to ‚ÄúLong‚Äù Format

An inverse operation to pivot for DataFrames is pandas.melt. Rather than trans‚Äê
forming one column into many in a new DataFrame, it merges multiple columns into
one, producing a DataFrame that is longer than the input. Let‚Äôs look at an example:

In [ ]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],'A': [1, 2, 3],'B': [4, 5, 6],'C': [7, 8, 9]})

In [ ]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

The 'key' column may be a group indicator, and the other columns are data values.
When using pandas.melt, we must indicate which columns (if any) are group indica‚Äê
tors. Let‚Äôs use 'key' as the only group indicator here:

In [ ]:
melted = pd.melt(df, ['key'])

In [ ]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [ ]:
reshaped = melted.pivot('key', 'variable', 'value')

In [ ]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [ ]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [ ]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [ ]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [ ]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6